src/k-bench-results/k3s/reliability-worker-v1/reliability-worker-4/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1342.08          ---          ---        13.54656        12.60700        27.26300        45.82300       103.39 
Gets        13419.18         4.67     13414.52        13.53620        12.60700        27.13500        46.07900       522.87 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      14761.26         4.67     13414.52        13.53714        12.60700        27.13500        46.07900       626.26 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       2.015        0.000
SET      11.391        5.000
SET      11.903       10.000
SET      12.095       15.000
SET      12.223       20.000
SET      12.287       25.000
SET      12.351       30.000
SET      12.415       35.000
SET      12.479       40.000
SET      12.543       45.000
SET      12.607       50.000
SET      12.607       52.500
SET      12.671       55.000
SET      12.671       57.500
SET      12.735       60.000
SET      12.735       62.500
SET      12.799       65.000
SET      12.799       67.500
SET      12.863       70.000
SET      12.927       72.500
SET      12.991       75.000
SET      13.055       76.250
SET      13.119       77.500
SET      13.183       78.750
SET      13.247       80.000
SET      13.311       81.250
SET      13.439       82.500
SET      13.567       83.750
SET      13.759       85.000
SET      14.015       86.250
SET      14.463       87.500
SET      14.719       88.125
SET      14.975       88.750
SET      15.231       89.375
SET      15.551       90.000
SET      15.935       90.625
SET      16.639       91.250
SET      17.663       91.875
SET      19.327       92.500
SET      21.247       93.125
SET      22.655       93.750
SET      23.167       94.062
SET      23.423       94.375
SET      23.807       94.688
SET      23.935       95.000
SET      24.191       95.312
SET      24.319       95.625
SET      24.575       95.938
SET      24.703       96.250
SET      24.831       96.562
SET      24.959       96.875
SET      25.087       97.031
SET      25.087       97.188
SET      25.215       97.344
SET      25.215       97.500
SET      25.343       97.656
SET      25.471       97.812
SET      25.471       97.969
SET      25.599       98.125
SET      25.727       98.281
SET      25.855       98.438
SET      25.983       98.516
SET      26.111       98.594
SET      26.239       98.672
SET      26.367       98.750
SET      26.623       98.828
SET      26.879       98.906
SET      27.263       98.984
SET      27.647       99.062
SET      28.159       99.141
SET      28.927       99.219
SET      29.311       99.258
SET      29.823       99.297
SET      30.207       99.336
SET      30.719       99.375
SET      31.359       99.414
SET      31.999       99.453
SET      32.767       99.492
SET      33.535       99.531
SET      34.047       99.570
SET      35.071       99.609
SET      35.583       99.629
SET      36.095       99.648
SET      36.607       99.668
SET      37.119       99.688
SET      37.887       99.707
SET      38.399       99.727
SET      38.911       99.746
SET      39.679       99.766
SET      40.447       99.785
SET      41.215       99.805
SET      41.471       99.814
SET      42.239       99.824
SET      42.495       99.834
SET      43.007       99.844
SET      43.519       99.854
SET      43.775       99.863
SET      44.287       99.873
SET      44.799       99.883
SET      45.311       99.893
SET      46.079       99.902
SET      46.335       99.907
SET      46.591       99.912
SET      46.847       99.917
SET      47.359       99.922
SET      47.615       99.927
SET      48.127       99.932
SET      48.383       99.937
SET      48.639       99.941
SET      49.151       99.946
SET      49.919       99.951
SET      50.431       99.954
SET      50.687       99.956
SET      50.943       99.958
SET      51.455       99.961
SET      51.967       99.963
SET      52.735       99.966
SET      52.991       99.968
SET      53.503       99.971
SET      54.271       99.973
SET      54.527       99.976
SET      54.783       99.977
SET      55.039       99.978
SET      55.295       99.979
SET      55.551       99.980
SET      55.807       99.982
SET      56.063       99.983
SET      56.575       99.984
SET      57.087       99.985
SET      57.343       99.987
SET      57.599       99.988
SET      58.111       99.988
SET      58.111       99.989
SET      58.623       99.990
SET      59.391       99.990
SET      59.903       99.991
SET      60.159       99.991
SET      60.671       99.992
SET      61.439       99.993
SET      61.951       99.993
SET      62.207       99.994
SET      62.463       99.994
SET      62.463       99.995
SET      62.975       99.995
SET      63.487       99.995
SET      63.999       99.995
SET      64.255       99.996
SET      64.511       99.996
SET      65.535       99.996
SET      65.535       99.997
SET      66.047       99.997
SET      66.047       99.997
SET      66.047       99.997
[...]
SET      66.559       99.998
SET      67.071       99.998
SET      67.583       99.998
SET      68.095       99.998
SET      68.607       99.998
SET      69.631       99.998
SET      70.655       99.998
SET      70.655       99.999
SET      70.655       99.999
SET      70.655       99.999
SET      71.167       99.999
SET      71.167       99.999
SET      72.703       99.999
SET      72.703       99.999
SET      72.703       99.999
SET      73.727       99.999
SET      73.727       99.999
SET      73.727       99.999
[...]
SET      75.775       99.999
SET      75.775       99.999
SET      75.775       99.999
SET      77.311      100.000
SET      77.311      100.000
SET      77.311      100.000
[...]
SET      78.847      100.000
SET      78.847      100.000
SET      78.847      100.000
[...]
SET      80.383      100.000
SET      80.383      100.000
SET      80.383      100.000
[...]
SET      87.551      100.000
SET      87.551      100.000
---
GET       1.623        0.000
GET      11.391        5.000
GET      11.903       10.000
GET      12.095       15.000
GET      12.223       20.000
GET      12.287       25.000
GET      12.351       30.000
GET      12.415       35.000
GET      12.479       40.000
GET      12.543       45.000
GET      12.607       50.000
GET      12.607       52.500
GET      12.671       55.000
GET      12.671       57.500
GET      12.735       60.000
GET      12.735       62.500
GET      12.799       65.000
GET      12.799       67.500
GET      12.863       70.000
GET      12.927       72.500
GET      12.991       75.000
GET      13.055       76.250
GET      13.119       77.500
GET      13.119       78.750
GET      13.247       80.000
GET      13.311       81.250
GET      13.375       82.500
GET      13.567       83.750
GET      13.695       85.000
GET      14.015       86.250
GET      14.399       87.500
GET      14.655       88.125
GET      14.911       88.750
GET      15.167       89.375
GET      15.487       90.000
GET      15.871       90.625
GET      16.511       91.250
GET      17.407       91.875
GET      19.071       92.500
GET      20.991       93.125
GET      22.527       93.750
GET      23.039       94.062
GET      23.423       94.375
GET      23.679       94.688
GET      23.935       95.000
GET      24.191       95.312
GET      24.319       95.625
GET      24.447       95.938
GET      24.703       96.250
GET      24.831       96.562
GET      24.959       96.875
GET      24.959       97.031
GET      25.087       97.188
GET      25.215       97.344
GET      25.215       97.500
GET      25.343       97.656
GET      25.343       97.812
GET      25.471       97.969
GET      25.599       98.125
GET      25.727       98.281
GET      25.855       98.438
GET      25.983       98.516
GET      26.111       98.594
GET      26.239       98.672
GET      26.367       98.750
GET      26.623       98.828
GET      26.751       98.906
GET      27.135       98.984
GET      27.519       99.062
GET      28.031       99.141
GET      28.799       99.219
GET      29.183       99.258
GET      29.695       99.297
GET      30.207       99.336
GET      30.719       99.375
GET      31.359       99.414
GET      31.999       99.453
GET      32.639       99.492
GET      33.535       99.531
GET      34.303       99.570
GET      35.071       99.609
GET      35.583       99.629
GET      36.095       99.648
GET      36.607       99.668
GET      37.375       99.688
GET      37.887       99.707
GET      38.399       99.727
GET      39.167       99.746
GET      39.935       99.766
GET      40.703       99.785
GET      41.471       99.805
GET      41.983       99.814
GET      42.239       99.824
GET      42.751       99.834
GET      43.007       99.844
GET      43.519       99.854
GET      44.031       99.863
GET      44.543       99.873
GET      45.055       99.883
GET      45.567       99.893
GET      46.079       99.902
GET      46.335       99.907
GET      46.847       99.912
GET      47.103       99.917
GET      47.359       99.922
GET      47.871       99.927
GET      48.127       99.932
GET      48.639       99.937
GET      49.151       99.941
GET      49.663       99.946
GET      50.431       99.951
GET      50.687       99.954
GET      50.943       99.956
GET      51.455       99.958
GET      51.711       99.961
GET      52.223       99.963
GET      52.735       99.966
GET      53.247       99.968
GET      53.759       99.971
GET      54.271       99.973
GET      54.783       99.976
GET      55.039       99.977
GET      55.295       99.978
GET      55.551       99.979
GET      55.807       99.980
GET      56.319       99.982
GET      56.575       99.983
GET      57.087       99.984
GET      57.343       99.985
GET      57.855       99.987
GET      58.367       99.988
GET      58.623       99.988
GET      58.879       99.989
GET      59.135       99.990
GET      59.647       99.990
GET      59.903       99.991
GET      60.159       99.991
GET      60.671       99.992
GET      60.927       99.993
GET      61.439       99.993
GET      61.951       99.994
GET      62.207       99.994
GET      62.463       99.995
GET      62.719       99.995
GET      62.975       99.995
GET      63.231       99.995
GET      63.487       99.996
GET      63.743       99.996
GET      63.999       99.996
GET      64.511       99.997
GET      65.023       99.997
GET      65.023       99.997
GET      65.279       99.997
GET      65.535       99.997
GET      66.047       99.998
GET      66.047       99.998
GET      66.559       99.998
GET      67.071       99.998
GET      67.071       99.998
GET      67.583       99.998
GET      68.095       99.998
GET      68.095       99.999
GET      68.095       99.999
GET      68.607       99.999
GET      68.607       99.999
GET      69.119       99.999
GET      70.143       99.999
GET      70.143       99.999
GET      71.167       99.999
GET      71.679       99.999
GET      72.191       99.999
GET      72.191       99.999
GET      73.215       99.999
GET      73.727       99.999
GET      73.727       99.999
GET      74.751       99.999
GET      74.751       99.999
GET      75.775      100.000
GET      76.287      100.000
GET      76.799      100.000
GET      77.311      100.000
GET      77.311      100.000
GET      77.311      100.000
GET      77.823      100.000
GET      78.335      100.000
GET      78.335      100.000
GET      78.847      100.000
GET      78.847      100.000
GET      78.847      100.000
GET      79.359      100.000
GET      79.359      100.000
GET      79.359      100.000
[...]
GET      79.871      100.000
GET      79.871      100.000
GET      80.383      100.000
GET      80.895      100.000
GET      80.895      100.000
GET      80.895      100.000
GET      81.407      100.000
GET      81.407      100.000
GET      81.407      100.000
[...]
GET      82.943      100.000
GET      82.943      100.000
GET      83.967      100.000
GET      83.967      100.000
GET      83.967      100.000
[...]
GET      86.527      100.000
GET      86.527      100.000
GET      86.527      100.000
[...]
GET      87.039      100.000
GET      87.039      100.000
---
WAIT      0.000      100.000